Tekla Open API Reference for Tekla Structures 2025
ObjectTypesFilterExpressions.CategoryName Constructor
 Initializes a new instance of the CategoryName class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CategoryName()
Public Sub New
See Also
Reference
ObjectTypesFilterExpressions.CategoryName Class
Tekla.Structures.Filtering.Categories Namespace